# Python Assignment – Pandas

### 1. Define and create a Dataframe using Pandas.

In [1]:
import pandas as pd
df = pd.DataFrame()

### 2. How can we calculate the standard deviation from the series.

In [2]:
sample=pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8])
sample.std()

0.6986279069583123

### 3. Create a Dataframe using List given below:
### lis=[‘Python’,’Numpy’,’Pandas’]

In [3]:
lis=['Python','Numpy','Pandas']
df=pd.DataFrame(lis)
df

        0
0  Python
1   Numpy
2  Pandas

### 4. Create a Series from dictionary given below:
### info = {'x' : 0., 'y' : 1., 'z' : 2.}

In [4]:
info = {'x' : 0., 'y' : 1., 'z' : 2.}
df=pd.Series(info)
df

x    0.0
y    1.0
z    2.0
dtype: float64

### 5. How will you create an empty Dataframe in Pandas?

In [5]:
df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

### 6. i) Add a column to that pandas Dataframe that you created in Q1
###   ii) Change index of that Dataframe.

In [6]:
import numpy as np
df['new'] = pd.Series(np.random.randn(5))  #Adding a column
df

        new
0  1.633916
1 -0.591123
2  1.419689
3  1.038477
4 -2.109655

In [7]:
df.set_index(pd.Series(['a','b','c','d','e'])) #Change index
df

        new
0  1.633916
1 -0.591123
2  1.419689
3  1.038477
4 -2.109655

### 7. Get the following from this dataframe:
- import random
- A = [ random.randint(0,100) for i in range(10) ]
- B = [ random.randint(0,100) for i in range(10) ]
- df = pd.DataFrame({ 'field_A': A, 'field_B': B })
- i) mean
ii) median
iii) mode
iv) 75th percentile
v) 90th percentile
vi) 99th percentile

In [8]:
import random
A = [ random.randint(0,100) for i in range(10) ]
B = [ random.randint(0,100) for i in range(10) ]
df = pd.DataFrame({ 'field_A': A, 'field_B': B })
print(df)
print('Mean:\n',df.mean())
print('Median:\n',df.median())
print('Mode:\n',df.mode())
print('75th percentile:\n',df.quantile(0.75))
print('90th percentile:\n',df.quantile(0.9))
print('99th percentile:\n',df.quantile(0.99))

   field_A  field_B
0        0       25
1       20       10
2       59       79
3       57       73
4       84       83
5       60       35
6       16       29
7       37        6
8        3       40
9       89       74
Mean:
 field_A    42.5
field_B    45.4
dtype: float64
Median:
 field_A    47.0
field_B    37.5
dtype: float64
Mode:
    field_A  field_B
0        0        6
1        3       10
2       16       25
3       20       29
4       37       35
5       57       40
6       59       73
7       60       74
8       84       79
9       89       83
75th percentile:
 field_A    59.75
field_B    73.75
Name: 0.75, dtype: float64
90th percentile:
 field_A    84.5
field_B    79.4
Name: 0.9, dtype: float64
99th percentile:
 field_A    88.55
field_B    82.64
Name: 0.99, dtype: float64

### 8. How do you count how many unique rows a DataFrame has (i.e. ignore all rows that are duplicates)?

In [9]:
df=pd.DataFrame({'A':[1,1,3,1,2,2],'B':[1,1,3,1,2,2]})
df.groupby(['A','B']).size()

A  B
1  1    3
2  2    2
3  3    1
dtype: int64

### 9.How to keep only top 2 most frequent values as it is and replace everything else as ‘Other’? Take the following as input.
- np.random.RandomState(100)
- ser = pd.Series(np.random.randint(1, 5, [12]))

In [10]:
np.random.RandomState(100)
ser = pd.Series(np.random.randint(1, 5, [12]))
print(ser)
ser[ser.isin(ser.value_counts().index[2:])]='Other'
ser

0     4
1     4
2     1
3     1
4     1
5     4
6     4
7     2
8     3
9     2
10    1
11    4
dtype: int32

0         4
1         4
2         1
3         1
4         1
5         4
6         4
7     Other
8     Other
9     Other
10        1
11        4
dtype: object

### 10. A DataFrame has a column of groups 'grps' and and column of integer values 'vals':
- df = pd.DataFrame({'grps':list('aaabbcaabcccbbc'),'vals': [12, 345, 3, 1, 45, 14 , 4, 52, 54, 23, 235, 21, 57, 3, 87]})
### For each group, find the sum of the three greatest values. Youshould end up with the answer as follows:
- grps
- a 409
- b 156
- c 345

In [11]:
df = pd.DataFrame({'grps':list('aaabbcaabcccbbc'),'vals': [12, 345, 3, 1, 45, 14 , 4, 52, 54, 23, 235, 21, 57, 3, 87]})
df.groupby('grps')['vals'].nlargest(3).sum(level=0)

grps
a    409
b    156
c    345
Name: vals, dtype: int64

## *Create a dataframe for the following to answer the next few questions

In [12]:
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat',
'snake', 'cat', 'dog', 'dog'],
'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no',
'no']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df2=pd.DataFrame(data,index=labels)

### 11. Display a summary of the basic information about this DataFrame and its data (hint: there is a single method that can be called on the DataFrame).

In [13]:
df2.describe(include='all')

       animal       age     visits priority
count      10  8.000000  10.000000       10
unique      3       NaN        NaN        2
top       dog       NaN        NaN       no
freq        4       NaN        NaN        6
mean      NaN  3.437500   1.900000      NaN
std       NaN  2.007797   0.875595      NaN
min       NaN  0.500000   1.000000      NaN
25%       NaN  2.375000   1.000000      NaN
50%       NaN  3.000000   2.000000      NaN
75%       NaN  4.625000   2.750000      NaN
max       NaN  7.000000   3.000000      NaN

### 12. Select the rows where the age is between 2 and 4 (inclusive).

In [14]:
df2[df2['age'].between(2,4)]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
f    cat  2.0       3       no
j    dog  3.0       1       no

### 13. Select the data in rows [3, 4, 8] and in columns ['animal', 'age'].

In [15]:
df2.iloc[[3, 4, 8],[0,1]]

  animal  age
d    dog  NaN
e    dog  5.0
i    dog  7.0

### 14. Select the rows where the age is missing, i.e. it is NaN.

In [16]:
df2[df2['age'].isna()]

  animal  age  visits priority
d    dog  NaN       3      yes
h    cat  NaN       1      yes

### 15. Select the rows where the animal is a cat and the age is less than 3.

In [17]:
df2[(df2['animal'] == 'cat') & (df2['age'] < 3)]

  animal  age  visits priority
a    cat  2.5       1      yes
f    cat  2.0       3       no

### 16. Change the age in row 'f' to 1.5.

In [18]:
df2.loc['f','age']=1.5
df2

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  1.5       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

### 17. In the 'animal' column, change the 'snake' entries to 'python'.

In [19]:
df2['animal'] = df2['animal'].replace('snake', 'python')
df2

   animal  age  visits priority
a     cat  2.5       1      yes
b     cat  3.0       3      yes
c  python  0.5       2       no
d     dog  NaN       3      yes
e     dog  5.0       2       no
f     cat  1.5       3       no
g  python  4.5       1       no
h     cat  NaN       1      yes
i     dog  7.0       2       no
j     dog  3.0       1       no

### 18. Count the number of each type of animal in df.

In [20]:
df2.groupby('animal').size()

animal
cat       4
dog       4
python    2
dtype: int64

### 19. The 'priority' column contains the values 'yes' and 'no'. Replace this column with a column of boolean values: 'yes' should be True and 'no' should be False.

In [21]:
df2['priority'] = df2['priority'].replace('yes', 'True').replace('no','False')
df2

   animal  age  visits priority
a     cat  2.5       1     True
b     cat  3.0       3     True
c  python  0.5       2    False
d     dog  NaN       3     True
e     dog  5.0       2    False
f     cat  1.5       3    False
g  python  4.5       1    False
h     cat  NaN       1     True
i     dog  7.0       2    False
j     dog  3.0       1    False

### 20. For each animal type and each number of visits, find the mean age. In other words, each row is an animal, each column is a number of visits and the values are the mean ages (hint: use a pivot table).

In [22]:
pd.pivot_table(df2, values='age', index=['visits'],
                    columns=['animal'], aggfunc=np.mean)

animal   cat  dog  python
visits
1       2.50  3.0     4.5
2        NaN  6.0     0.5
3       2.25  NaN     NaN